app/views/donations/index.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    </h3>
    <%= image_tag donation.project.image.exists? ? donation.project.image.url : 'zelda.jpg' %>