app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "project_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 51], ["project_id", 21], ["content", "ddfafaewfsfae"], ["created_at", 2017-05-11 00:33:02 UTC], ["updated_at", 2017-05-11 00:33:02 UTC]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save