app/controllers/donations_controller.rb

  def index
    @user = User.find_by(id: params[:user_id])
    @donations = Donation.where(user_id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = $1  [["user_id", 53]]

  def create
    @donation = Donation.new(donation_params)
    respond_to do |format|
      if @donation.save
---
INSERT INTO "donations" ("user_id", "project_id", "ammount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 51], ["project_id", 21], ["ammount", 123123.0], ["created_at", 2017-05-10 21:02:00 UTC], ["updated_at", 2017-05-10 21:02:00 UTC]]