app/controllers/home_controller.rb

  def main
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def search
    @by_title = Project.where('title ILIKE :search',
                                 search: "%#{params[:search]}%")
---
SELECT "projects".* FROM "projects" WHERE (description ILIKE '%a%'  AND publish = true)