app/controllers/projects_controller.rb

  def index
    @projects = Project.where(publish: true)
    @mines = false
    if params[:user_id]
      @projects = Project.where(user_id: params[:user_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."publish" = $1 ORDER BY "projects"."updated_at" DESC  [["publish", true]]
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 2]]

  def show
    unless @project.publish || current_user == @project.user
      redirect_to root_path, alert: 'No esta disponible'
    end
    @comments = Comment.where(project_id: @project.id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."project_id" = $1  [["project_id", 21]]

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("goal", "title", "description", "user_id", "category_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "publish" = $4, "updated_at" = $5 WHERE "projects"."id" = $6  [["image_file_name", "1_A_(255).JPG"], ["image_file_size", 1118640], ["image_updated_at", 2017-05-12 03:42:49 UTC], ["publish", true], ["updated_at", 2017-05-12 03:42:49 UTC], ["id", 121]]