app/controllers/projects_controller.rb

  def index
    @projects = Project.where(publish: true).order(end_date: :desc, rating: :desc)
                       .paginate(page: params[:page], per_page: 9)
    @mines = false
    if request.original_url.to_s.include?('users')
      @mines = current_user ? current_user.id.to_s == params[:user_id] : false
      if @mines
        @projects = Project.where(user_id: params[:user_id])
                           .paginate(page: params[:page], per_page: 6)
---
SELECT COUNT(*) FROM "projects" WHERE "projects"."publish" = $1  [["publish", true]]
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 4]]