app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.admin = false
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "email", "password", "name", "last_name", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"