app/views/layouts/_menu.html.erb

      <%= link_to 'Editar cuenta', edit_user_path(current_user) %>
      <% if current_user.projects.size > 0 %>
---
SELECT COUNT(*) FROM "projects" WHERE "projects"."user_id" = $1  [["user_id", 4]]